{"title":"Do authors write what they know?","description":"Do they?","distance":[{"step":"0","text":"I had the chance to hear Zadie Smith speak at a UCLA event in 2017, at which she joked about being unable to set her work anywhere but Willesden, the north-west London neighborhood she grew up in."},{"step":"1","text":"Four of Smith’s five novels are partly set in or very near Willesden. The exception to this is On Beauty, which is set in Cambridge, Massachusetts. Smith was a fellow at Harvard two years prior to the publication of this novel – so where she’s lived certainly seems to impact where she sets her work."},{"step":"2","text":"That got me wondering: How far from a place they’ve called “home” do writers tend to set their works? The famous saying, of disputed origins, goes “Write what you know.” But do authors usually “write where they know,” like Smith?"},{"step":"3","text":"To determine this, we took a look at the best 100 books written since 1900, per <a href=thegreatestbooks.org target=_blank>The Greatest Books</a>."},{"step":"4","text":"We found that 61 of the 100 books on the list are at least partly set in a place an author lived in. For the other 39 books, the median minimum distance between a setting and an author residence is only 82.58 miles."},{"step":"5","text":"The chart shows two outliers – Roberto Bolaño’s 2666 and John Updike’s Rabbit at Rest. Bolaño never visited Ciudad Juárez, Mexico, the city his novel’s Santa Teresa is based on. However, he was in frequent contact with Sergio González Rodríguez, an investigative journalist who reported extensively on the murders of women in Ciudad Juárez that form the factual bedrock of Bolaño’s novel. Bolaño wrote, in a short essay titled Sergio González Rodríguez In the Eye of the Storm, “His technical help – if I can call it that – in the writing of my novel, which I have yet to finish and don’t know if I’ll ever finish, has been substantial.”"},{"step":"6","text":"Updike’s Rabbit at Rest is the fourth and final book in a series that follows one man through 30 years. In the novel, protagonist Harry “Rabbit” Angstrom retires to Florida, having spent the first three books of the series in the fictional city of Brewer, Pennsylvania. Updike was a Pennsylvania native himself; Rabbit is thus a character steeped in and transplanted from a setting his creator was extremely familiar with."}]}