{"title":"Do Authors Write Where They Know?","description":"How near or far do authors set their books to where they’ve lived?","intro":[{"type":"text","value":"I had the chance to hear Zadie Smith speak at a UCLA event in 2017, at which she joked about being unable to set her work anywhere but Willesden, the north-west London neighborhood she grew up in."},{"type":"text","value":"Four of Smith’s five novels are partly set in or very near Willesden. The exception to this is <em>On Beauty</em>, which is set in Cambridge, Massachusetts. Smith was a fellow at Harvard two years prior to the publication of this novel – so where she’s lived certainly seems to impact where she sets her work."},{"type":"text","value":"That got me wondering: How far from a place they’ve called “home” do writers tend to set their works? The famous saying, of disputed origins, goes “Write what you know.” But do authors usually “write where they know,” like Smith?"},{"type":"text","value":"To answer this question, we took a look at the <a href=thegreatestbooks.org target=_blank>best 100 books</a> written since 1900. We then calculated every possible distance between book setting and author residence to find the smallest value for each book. This told us if at least part of their book was based on a place familiar to the author."}],"distanceTween":[],"distance":[{"step":"1","text":"Here is Smith’s debut novel, <mark><em>White Teeth</em></mark>. The nearest book setting/author residence combo is a distance of 0 miles."},{"step":"2","text":"On the other end of the spectrum is Roberto Bolaño’s <mark><em>2666</em></mark>. Bolaño never visited Ciudad Juárez, Mexico, the city his novel’s Santa Teresa is based on. However, he was in frequent contact with Sergio González Rodríguez, an investigative journalist who reported extensively on the murders of women in Ciudad Juárez that form the factual bedrock of Bolaño’s novel.","moretext":"Bolaño wrote, in a short essay titled Sergio González Rodríguez In the Eye of the Storm, “His technical help – if I can call it that – in the writing of my novel, which I have yet to finish and don’t know if I’ll ever finish, has been substantial.”"},{"step":"3","text":"Here are the rest of them. We found that 61 of the 100 books on the list are at least partly set in a place an author lived in. For the other 39 books, the median minimum distance between a setting and an author residence is only 73.7 miles."},{"step":"4","text":"The other notable outlier is John Updike’s <mark><em>Rabbit at Rest</em></mark>, the fourth and final book in a series that follows one man through 30 years. In the novel, protagonist Harry “Rabbit” Angstrom retires to Florida, having spent the first three books of the series in the fictional city of Brewer, Pennsylvania. Updike was a Pennsylvania native himself; Rabbit is thus a character steeped in and transplanted from a setting his creator was extremely familiar with."},{"step":"5","text":"Explore all top 100 books yourself."}],"timelineHed":"Residence and setting: an author-level exploration","timelineDek":"To further understand the relationship between author residence and book setting, we took a closer look at the oeuvres of 11 authors.","deep-dive":[{"name":"Virginia Woolf","lifespan":"1882 - 1941","slug":"woolf","text":"Woolf lived quite a fixed life: She lived in England throughout, maintaining a London residence for most of that time. She spent her childhood summers at St. Ives in Cornwall, which inspired the setting for <em>To The Lighthouse</em>, one of her most acclaimed works. Most of her writing is England-centric, with only brief sojourns elsewhere. Even the ship that forms the setting for <em>The Voyage Out</em> is a microcosm of Edwardian London society, which Woolf was well acquainted with. For most of her career, she set her books in the present or immediate past; for example, <em>Mrs. Dalloway</em>, written in 1925, takes place on a single day in post-World War I London."},{"name":"F. Scott Fitzgerald","lifespan":"1896 - 1940","slug":"fitzgerald","text":"Fitzgerald mainly grew up on the East Coast, and it shows in his writing. His first three books are set entirely in New York and New Jersey. The fictional West Egg, which forms the setting for <em>The Great Gatsby</em>, is based on Great Neck, the area of Long Island he lived in for three years. His later works – like his later life – take place further afield, traveling across Europe and journeying to Los Angeles. While he never lived in the specific places that <em>Tender Is The Night</em> lingers in, his years spent in Europe inform the work, giving the backdrop to Dick and Nicole Diver’s story a casual specificity, one that’s evident from the novel’s very first paragraph. His penchant for using familiar settings continued through his final novel,<em>The Last Tycoon</em>, in which he takes on the world of Hollywood, where he spent his last few years writing film scripts."},{"name":"George Orwell","lifespan":"1903 - 1950","slug":"orwell","text":"Orwell lived a life in transit; he rarely ever settled anywhere for over two years. Perhaps relatedly, his best works of fiction, Animal Farm and 1984, are not specifically concerned with evoking a sense of place; their preoccupations are more political. His lesser-known works, however, all explicitly draw on locations he’d lived in, as does some of his nonfiction, such as Down and Out in Paris and London and The Road To Wigan Pier."},{"name":"Shirley Jackson","lifespan":"1916 - 1965","slug":"jackson","text":"Geographical setting isn’t something Shirley Jackson’s best work much concerns itself with. Her books are in the tradition of Gothic horror, which places utmost importance on the structure in which the action unfolds: The genre was in fact named for its sinister settings’ style of architecture. Jackson’s modern Gothic novels intimately acquaint readers with the layouts and quirks of the buildings at their centers, such as the Vermont estate of <em>We Have Always Lived in the Castle</em> and the titular Hill House. But these buildings could, for the most part, be anywhere, because the action takes place in the protagonist’s psyche."},{"name":"J. D. Salinger","lifespan":"1919 - 2010","slug":"salinger","text":"Salinger is a New York City writer, through and through. He grew up in Manhattan, spending a good amount of his adult life in the city as well. His literary career hit its stride when he was first published in the New Yorker, to which he then onward frequently contributed. Most of his stories and novellas follow the fictional Glass family, who reside in Manhattan’s Upper East Side. While his ubiquitous book, <em>The Catcher in the Rye</em> ventures beyond NYC to a school based on one he briefly attended in Wayne, PA, as well as fleetingly to Los Angeles, it’s clear that New York shaped and formed the backdrop of most of his published creative output."},{"name":"Toni Morrison","lifespan":"1931 - 2019","slug":"morrison","text":"Morrison set her first novel in Lorain, OH, where she grew up. “I am from the Midwest, so I have a special affection for it. … No matter what I write, I begin there,” she said in a 1983 interview. However, many of her narratives unfold in places she never lived. This is likely because, more than mining her specific experiences for her work, Morrison explored and cataloged the African-American experience – fundamentally reshaping the canon of black literature as she did so. In the same interview, she adds, “Ohio offers an escape from stereotyped black settings. It is neither plantation nor ghetto.” When she chose Ohio as a setting, she did so not only for her familiarity with the place, but also for its ability to aid her in liberating black characters from contexts they had long been confined to."},{"name":"Kazuo Ishiguro","lifespan":"1954 - present","slug":"ishiguro","text":"Ishiguro’s family immigrated to Britain from Japan when he was only five years old. In his wonderful <a href “https://www.nobelprize.org/prizes/literature/2017/ishiguro/25124-kazuo-ishiguro-nobel-lecture-2017/”>2017 Nobel lecture</a>, he outlines his experiences grappling with his identity in relation to his geocultural roots, both as a child and an adult. He cites as a pivotal moment in his literary career the night he found himself “writing, with a new and urgent intensity, about Japan” after a few weeks of attempting to set a story in Britain. That night sparked a journey that would turn into his first novel <em>A Pale View of Hills</em>. The book, he says, was his way of preserving a Japan that was borne of and existed only in his mind, “to which (he) in some way belonged, and from which (his) drew a certain sense of (his) identity.”"},{"name":"Khaled Hosseini","lifespan":"1965 - present","slug":"hosseini","text":"Hosseini’s stories and characters are greatly shaped by his own experience of immigration. Two of his three books travel the same path he did, from Kabul to California. <em>And the Mountains Echoed</em> even makes a stop in Paris, where his family spent four years waiting for unrest in Afghanistan to pass. Their eventual inability to return brought about their seeking political asylum in the U.S. and moving to San Jose. Hosseini’s repeated literary traversal of this path brings out how pivotal this prolonged experience of unsettlement and immigration was to his life and worldview."},{"name":"Zadie Smith","lifespan":"1975 - present","slug":"smith","text":"As we’ve already seen, Smith’s creative output is very influenced by where she’s lived. At the 2017 event I mentioned earlier, she said she was working on a novel set 150 years in the past ... but still based in Willesden. I can’t wait to read that book."},{"name":"Celeste Ng","lifespan":"1980 - present","slug":"ng","text":"Ng’s two novels take place in Ohio, where she spent eight years of her childhood. Her second book, <em>Little Fires Everywhere</em> all the more specifically unfolds in Shaker Heights, OH, the city she lived in. Analyzing the work of two early-career writers – Ng and Sally Rooney – highlighted to me how likely writers’ earliest works are to draw on childhood abodes. Almost every writer on this list set their earliest work where they grew up – even Shirley Jackson, who pretty much abandoned geographically locating her novels halfway through her literary career."},{"name":"Sally Rooney","lifespan":"1991 - present","slug":"rooney","text":"Rooney is kind of a big deal, both in literary circles and beyond, these days. Her two novels resonate world over because they’re about interpersonal relationships and emotional intimacy. It can only help that they’re set in locations Rooney is intimately familiar with – Dublin and County Sligo, Ireland."}],"method":[{"type":"text","value":"We used <a href=thegreatestbooks.org target=_blank>The Greatest Books</a>, a best-of list aggregator, to select the 100 books we analyze setting/residence combinations for. In addition to being written after 1900, all the books we look at are novels, specify their setting and are set in real places on Earth. The data collection process was largely manual."},{"type":"text","value":"We used the Haversine formula to calculate distances for each setting/residence combination, visualizing the smallest value for each book. Where book setting was unspecific – not city-level – we used the centroid of the state/country in question to calculate these distances."},{"type":"text","value":"Data was manually collected for the individual author charts as well. I chose well-known English-language writers whose lives and work I knew about, approximately picking one born in each decade since the 1880s."},{"type":"text","value":"For these individual charts, a setting is linked to the closest author residence providing the two are within 50 miles of each other. To avoid overgeneralization, if a setting was country-level, we did not match it to any author residence, not even if a residence was within that country."}]}